spec/data/stripe/subscription_get.json

{
  "id": "sub_JigYoW2aRYfl0R",
  "object": "subscription",
  "application_fee_percent": null,
  "automatic_tax": {
    "enabled": false
  },
  "billing": "charge_automatically",
  "billing_cycle_anchor": 1624389749,
  "billing_thresholds": null,
  "cancel_at": null,
  "cancel_at_period_end": false,
  "canceled_at": null,
  "collection_method": "charge_automatically",
  "created": 1624389749,
  "current_period_end": 1626981749,
  "current_period_start": 1624389749,
  "customer": "cus_JR8V3eF6JmvjKZ",
  "days_until_due": null,
  "default_payment_method": null,
  "default_source": null,
  "default_tax_rates": [],
  "discount": null,
  "ended_at": null,
  "invoice_customer_balance_settings": {
    "consume_applied_balance_on_void": true
  },
  "items": {
    "object": "list",
    "data": [
      {
        "id": "si_JigYnp1pfGlMbs",
        "object": "subscription_item",
        "billing_thresholds": null,
        "created": 1624389749,
        "metadata": {},
        "plan": {
          "id": "price_1J4s6rFFYxHXGyKx5NqSpSYB",
          "object": "plan",
          "active": true,
          "aggregate_usage": null,
          "amount": 2500,
          "amount_decimal": "2500",
          "billing_scheme": "per_unit",
          "created": 1624301077,
          "currency": "usd",
          "interval": "month",
          "interval_count": 1,
          "livemode": false,
          "metadata": {},
          "nickname": null,
          "product": "prod_JiIi6yyo7A3cha",
          "tiers": null,
          "tiers_mode": null,
          "transform_usage": null,
          "trial_period_days": null,
          "usage_type": "licensed"
        },
        "price": {
          "id": "price_1J4s6rFFYxHXGyKx5NqSpSYB",
          "object": "price",
          "active": true,
          "billing_scheme": "per_unit",
          "created": 1624301077,
          "currency": "usd",
          "livemode": false,
          "lookup_key": null,
          "metadata": {},
          "nickname": null,
          "product": "prod_JiIi6yyo7A3cha",
          "recurring": {
            "aggregate_usage": null,
            "interval": "month",
            "interval_count": 1,
            "trial_period_days": null,
            "usage_type": "licensed"
          },
          "tiers_mode": null,
          "transform_quantity": null,
          "type": "recurring",
          "unit_amount": 2500,
          "unit_amount_decimal": "2500"
        },
        "quantity": 1,
        "subscription": "sub_JigYoW2aRYfl0R",
        "tax_rates": []
      }
    ],
    "has_more": false,
    "total_count": 1,
    "url": "/v1/subscription_items?subscription=sub_JigYoW2aRYfl0R"
  },
  "latest_invoice": "in_1J5FB3FFYxHXGyKxLCTiXLJY",
  "livemode": false,
  "metadata": {},
  "next_pending_invoice_item_invoice": null,
  "pause_collection": null,
  "pending_invoice_item_interval": null,
  "pending_setup_intent": null,
  "pending_update": null,
  "plan": {
    "id": "price_1J4s6rFFYxHXGyKx5NqSpSYB",
    "object": "plan",
    "active": true,
    "aggregate_usage": null,
    "amount": 2500,
    "amount_decimal": "2500",
    "billing_scheme": "per_unit",
    "created": 1624301077,
    "currency": "usd",
    "interval": "month",
    "interval_count": 1,
    "livemode": false,
    "metadata": {},
    "nickname": null,
    "product": "prod_JiIi6yyo7A3cha",
    "tiers": null,
    "tiers_mode": null,
    "transform_usage": null,
    "trial_period_days": null,
    "usage_type": "licensed"
  },
  "quantity": 1,
  "schedule": null,
  "start": 1624397153,
  "start_date": 1624389749,
  "status": "active",
  "tax_percent": null,
  "transfer_data": null,
  "trial_end": null,
  "trial_start": null
}
